# RPCTurnOffInRealisticWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..RPCTurnOffInRealisticWarn Property
BuiltInFailures..::..EditingFailures Class See Also
---
None of the placed RPC elements are visible when the visual style is set to Realistic. To see the elements, change VisualStyle of the current view, or change RPC visibility in Graphic Display Options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RPCTurnOffInRealisticWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RPCTurnOffInRealisticWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RPCTurnOffInRealisticWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace